org/python-course/part1_4.org
#+TITLE: Baustein 1 Meeting 4

* Lösungen zu den letzten Aufgaben

(Alle Lösungen sind nur Beispiele, es gibt viele Wege die zur Lösung führen)

** Funktionen
#+BEGIN_SRC python :results output :exports both
def combat(health, damage):
    difference = health - damage
    if difference < 0:
        return 0
    else return difference
print(combat(health=100, damage=20))
print(combat(health=10, damage=30))
#+END_SRC
Oder einfacher:
#+BEGIN_SRC python
def combat(health, damage):
    return max(health - damage, 0)
#+END_SRC
#+BEGIN_SRC python :results output :exports both
def abbrevName(name):
    parts = name.split(" ")
    return parts[0][0].upper() + "." +  parts[1][0].upper()
#+END_SRC
#+BEGIN_SRC python :results output :exports both
def century(year):
    return ((year-1) // 100) +1
#+END_SRC

** Number guessing game
#+BEGIN_SRC python
user_eingabe = None
geheime_zahl = 42
while user_eingabe != geheime_zahl:
    user_eingabe = int(input("Bitte gebe eine Zahl ein: "))
    if user_eingabe > geheime_zahl:
        print("Zu hoch geschätzt!")
    elif user_eingabe < geheime_zahl:
        print("Zu niedrig geschätzt!")
    else:
        print("Richtig")
#+END_SRC

* Mengen
Mengen sind ungeordnete Sammlungen von Objekten. Sie können kein Element mehrfach enthalten:

#+BEGIN_SRC python :results output :exports both
my_numbers = {1, 2, 3, 4, 5, 5, 6, 6}
print(my_numbers)
#+END_SRC

Wie auch bei Listen und Dictionaries gibt es eine Built-in Funktion die bestimmte Objekte in Mengen umwandeln kann. Nochmal zur Übersicht:

~list(...)~

~dict(...)~

~set(...)~

Erzeugen Listen, Wörterbücher und Mengen aus ihren Argumenten (wenn möglich).


#+BEGIN_SRC python :results output :exports both
letter_set = set("A Python Tutorial")
print(letter_set)
meine_liste = ["A","B","C","A","B","C"]

leeres_wörterbuch = dict()

liste_ohne_duplikate = list(set(meine_liste))
#+END_SRC

* Objektorientierte Programmierung

