python-course/part1_4.html
<!doctype html>
<html lang="en">
<head>
<title>Baustein 1 Meeting 4</title>
<!-- 2020-01-09 Thu 17:55 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Falco Winkler">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="css/python_course.css">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Baustein 1 Meeting 4</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Lösungen zu den letzten Aufgaben</h2>
<div class="outline-text-2" id="text-1">
<p>
(Alle Lösungen sind nur Beispiele, es gibt viele Wege die zur Lösung führen)
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Funktionen</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">combat</span><span style="color: #4f97d7;">(</span>health, damage<span style="color: #4f97d7;">)</span>:
    <span style="color: #7590db;">difference</span> = health - damage
    <span style="color: #4f97d7; font-weight: bold;">if</span> difference &lt; <span style="color: #a45bad;">0</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">0</span>
    <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">return</span> difference
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>combat<span style="color: #bc6ec5;">(</span>health=<span style="color: #a45bad;">100</span>, damage=<span style="color: #a45bad;">20</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>combat<span style="color: #bc6ec5;">(</span>health=<span style="color: #a45bad;">10</span>, damage=<span style="color: #a45bad;">30</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Oder einfacher:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">combat</span><span style="color: #4f97d7;">(</span>health, damage<span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">max</span><span style="color: #4f97d7;">(</span>health - damage, <span style="color: #a45bad;">0</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">abbrevName</span><span style="color: #4f97d7;">(</span>name<span style="color: #4f97d7;">)</span>:
    <span style="color: #7590db;">parts</span> = name.split<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">" "</span><span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> parts<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">][</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span>.upper<span style="color: #4f97d7;">()</span> + <span style="color: #2d9574;">"."</span> +  parts<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">][</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span>.upper<span style="color: #4f97d7;">()</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">century</span><span style="color: #4f97d7;">(</span>year<span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>year-<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span> // <span style="color: #a45bad;">100</span><span style="color: #4f97d7;">)</span> +<span style="color: #a45bad;">1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Number guessing game</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">user_eingabe</span> = <span style="color: #a45bad;">None</span>
<span style="color: #7590db;">geheime_zahl</span> = <span style="color: #a45bad;">42</span>
<span style="color: #4f97d7; font-weight: bold;">while</span> user_eingabe != geheime_zahl:
    <span style="color: #7590db;">user_eingabe</span> = <span style="color: #4f97d7;">int</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">input</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"Bitte gebe eine Zahl ein: "</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> user_eingabe &gt; geheime_zahl:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Zu hoch gesch&#228;tzt!"</span><span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">elif</span> user_eingabe &lt; geheime_zahl:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Zu niedrig gesch&#228;tzt!"</span><span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">else</span>:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Richtig"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Mengen</h2>
<div class="outline-text-2" id="text-2">
<p>
Mengen sind ungeordnete Sammlungen von Objekten. Sie können kein Element mehrfach enthalten:
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">my_numbers</span> = <span style="color: #4f97d7;">{</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span>, <span style="color: #a45bad;">6</span><span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>my_numbers<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
set([1, 2, 3, 4, 5, 6])
</pre>


<p>
Wie auch bei Listen und Dictionaries gibt es eine Built-in Funktion die bestimmte Objekte in Mengen umwandeln kann. Nochmal zur Übersicht:
</p>

<p>
<code>list(...)</code>
</p>

<p>
<code>dict(...)</code>
</p>

<p>
<code>set(...)</code>
</p>

<p>
Erzeugen Listen, Wörterbücher und Mengen aus ihren Argumenten (wenn möglich).
</p>


<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">letter_set</span> = <span style="color: #4f97d7;">set</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"A Python Tutorial"</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>letter_set<span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">meine_liste</span> = <span style="color: #4f97d7;">[</span><span style="color: #2d9574;">"A"</span>,<span style="color: #2d9574;">"B"</span>,<span style="color: #2d9574;">"C"</span>,<span style="color: #2d9574;">"A"</span>,<span style="color: #2d9574;">"B"</span>,<span style="color: #2d9574;">"C"</span><span style="color: #4f97d7;">]</span>

<span style="color: #7590db;">leeres_w&#246;rterbuch</span> = <span style="color: #4f97d7;">dict</span><span style="color: #4f97d7;">()</span>

<span style="color: #7590db;">liste_ohne_duplikate</span> = <span style="color: #4f97d7;">list</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">set</span><span style="color: #bc6ec5;">(</span>meine_liste<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Objektorientierte Programmierung</h2>
