org/python-course/part1_4.org
** Klassen und Objekte

Zusammenhänge in der echten Welt sind sehr komplex. Computer hingegen sind eigentlich ziemlich doof: Sie können nur mit exakten Rechenregeln arbeiten und stumpf Befehle ausführen. Um die Welt "berechenbar" zu machen braucht man also immer ein Modell: Ein vereinfachtes Abbild der Wirklichkeit.

Objektorientierung ist eine Möglichkeit, Zusammenhänge zu modellieren. Die Grundidee ist, jede Sache in der echten Welt als Objekt mit einem Zustand und fest definiertem Verhalten darzustellen.

Klassen sind Baupläne für Objekte. Sie beschreiben, welche Funktionalität ein konkretes Objekt hat, und welche Zustände es besitzt. Objekte sind dann konkrete Instanzen von Klassen.

Wann ist also der Unterschied zwischen Datenstrukturen und Objekten? Datenstrukturen verstecken Funktionalität und bieten Daten an, Objekte bieten Funktionalität und verstecken Daten.

/Genauere Erklärung und Diskussion über OOP im Kurs/

#+BEGIN_SRC python :results output :exports both
class Bike:

    def __init__(self, model, color):
        self.model = model
        self.color = color
        self.current_speed = 0

    def speed_up(self):
        self.current_speed += 5

    def slow_down(self):
        self.current_speed -= 5

    def brake(self):
        self.current_speed = 0

    def describe(self):
        print(self.model, "has color", self.color,
              ", current speed is", str(self.current_speed), "km/h")

mountain_bike = Bike("mountain bike", "black")
mountain_bike.speed_up()
mountain_bike.describe()

city_bike = Bike("city bike", "pink")
city_bike.speed_up()
city_bike.speed_up()
city_bike.speed_up()
city_bike.describe()
city_bike.brake()
city_bike.describe()
#+END_SRC

** Vererbung

- Einige Klassen haben Gemeinsamkeiten und Unterschiede
- Die Gemeinsamkeiten wollen wir nicht doppelt in Code ausdrücken
- Deshalb erstellen wir eine “Elternklasse” mit den Gemeinsamkeiten und “erben” davon.

#+BEGIN_SRC python :results output :exports both
class Animal:

    def __init__(self, name, age):
        self.name = name
        self.age = age

    def eat(self):
        print(self.name + " isst etwas.")

    def move(self):
        print(self.name + " bewegt sich.")

class Bird(Animal):

    def fly(self):
        print("Ich kann flieeeegen - " + self.name + ".")

class Dog(Animal):

    def bark(self):
        print("Woof Woof")


class Mops(Dog):

    def bark(self):
        super().bark()
        print("fiep")

class Parrot(Bird, Dog):

    def __init__(self, name, age, color):
        super().__init__(name, age)
        self.color = color


loewe = Animal("Löwe", 5)
loewe.eat()
loewe.move()
print("-------------")
doggie = Dog("Doggie", 7)
doggie.bark()
doggie.eat()
print("-------------")
ruffi = Mops("Ruffi", 3)
ruffi.eat()
ruffi.bark()
#+END_SRC

** Übung: Objektorientiertes Bankkonto

Implementiert die Klasse ~Bankkonto~.

- Ein Bankkonto hat eine eindeutige ID und einen Kontostand (anfänglich 0)
- Man kann einen bestimmten Betrag einzahlen und auszahlen
- Man kann sich den aktuellen Kontostand ausgeben lassen
** Übung (fortgeschritten): Piraterie
https://www.codewars.com/kata/object-oriented-piracy

