python-course/part1_4.html
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Klassen und Objekte</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Zusammenhänge in der echten Welt sind sehr komplex. Computer hingegen sind eigentlich ziemlich doof: Sie können nur mit exakten Rechenregeln arbeiten und stumpf Befehle ausführen. Um die Welt "berechenbar" zu machen braucht man also immer ein Modell: Ein vereinfachtes Abbild der Wirklichkeit.
</p>

<p>
Objektorientierung ist eine Möglichkeit, Zusammenhänge zu modellieren. Die Grundidee ist, jede Sache in der echten Welt als Objekt mit einem Zustand und fest definiertem Verhalten darzustellen.
</p>

<p>
Klassen sind Baupläne für Objekte. Sie beschreiben, welche Funktionalität ein konkretes Objekt hat, und welche Zustände es besitzt. Objekte sind dann konkrete Instanzen von Klassen.
</p>

<p>
Wann ist also der Unterschied zwischen Datenstrukturen und Objekten? Datenstrukturen verstecken Funktionalität und bieten Daten an, Objekte bieten Funktionalität und verstecken Daten.
</p>

<p>
<i>Genauere Erklärung und Diskussion über OOP im Kurs</i>
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Bike</span>:

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, model, color<span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">self</span>.model = model
        <span style="color: #4f97d7; font-weight: bold;">self</span>.color = color
        <span style="color: #4f97d7; font-weight: bold;">self</span>.current_speed = <span style="color: #a45bad;">0</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">speed_up</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">self</span>.current_speed += <span style="color: #a45bad;">5</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">slow_down</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">self</span>.current_speed -= <span style="color: #a45bad;">5</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">brake</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">self</span>.current_speed = <span style="color: #a45bad;">0</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">describe</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.model, <span style="color: #2d9574;">"has color"</span>, <span style="color: #4f97d7; font-weight: bold;">self</span>.color,
              <span style="color: #2d9574;">", current speed is"</span>, <span style="color: #4f97d7;">str</span><span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.current_speed<span style="color: #bc6ec5;">)</span>, <span style="color: #2d9574;">"km/h"</span><span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">mountain_bike</span> = Bike<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"mountain bike"</span>, <span style="color: #2d9574;">"black"</span><span style="color: #4f97d7;">)</span>
mountain_bike.speed_up<span style="color: #4f97d7;">()</span>
mountain_bike.describe<span style="color: #4f97d7;">()</span>

<span style="color: #7590db;">city_bike</span> = Bike<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"city bike"</span>, <span style="color: #2d9574;">"pink"</span><span style="color: #4f97d7;">)</span>
city_bike.speed_up<span style="color: #4f97d7;">()</span>
city_bike.speed_up<span style="color: #4f97d7;">()</span>
city_bike.speed_up<span style="color: #4f97d7;">()</span>
city_bike.describe<span style="color: #4f97d7;">()</span>
city_bike.brake<span style="color: #4f97d7;">()</span>
city_bike.describe<span style="color: #4f97d7;">()</span>
</pre>
</div>

<pre class="example">
('mountain bike', 'has color', 'black', ', current speed is', '5', 'km/h')
('city bike', 'has color', 'pink', ', current speed is', '15', 'km/h')
('city bike', 'has color', 'pink', ', current speed is', '0', 'km/h')
</pre>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Vererbung</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Einige Klassen haben Gemeinsamkeiten und Unterschiede
</li>
<li>Die Gemeinsamkeiten wollen wir nicht doppelt in Code ausdrücken
</li>
<li>Deshalb erstellen wir eine “Elternklasse” mit den Gemeinsamkeiten und “erben” davon.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Animal</span>:

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, name, age<span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">self</span>.name = name
        <span style="color: #4f97d7; font-weight: bold;">self</span>.age = age

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">eat</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.name + <span style="color: #2d9574;">" isst etwas."</span><span style="color: #4f97d7;">)</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">move</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.name + <span style="color: #2d9574;">" bewegt sich."</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Bird</span><span style="color: #4f97d7;">(</span>Animal<span style="color: #4f97d7;">)</span>:

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">fly</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Ich kann flieeeegen - "</span> + <span style="color: #4f97d7; font-weight: bold;">self</span>.name + <span style="color: #2d9574;">"."</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Dog</span><span style="color: #4f97d7;">(</span>Animal<span style="color: #4f97d7;">)</span>:

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">bark</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Woof Woof"</span><span style="color: #4f97d7;">)</span>


<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Mops</span><span style="color: #4f97d7;">(</span>Dog<span style="color: #4f97d7;">)</span>:

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">bark</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7;">super</span><span style="color: #4f97d7;">()</span>.bark<span style="color: #4f97d7;">()</span>
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"fiep"</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Parrot</span><span style="color: #4f97d7;">(</span>Bird, Dog<span style="color: #4f97d7;">)</span>:

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, name, age, color<span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7;">super</span><span style="color: #4f97d7;">()</span>.__init__<span style="color: #4f97d7;">(</span>name, age<span style="color: #4f97d7;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.color = color


<span style="color: #7590db;">loewe</span> = Animal<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"L&#246;we"</span>, <span style="color: #a45bad;">5</span><span style="color: #4f97d7;">)</span>
loewe.eat<span style="color: #4f97d7;">()</span>
loewe.move<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"-------------"</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">doggie</span> = Dog<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Doggie"</span>, <span style="color: #a45bad;">7</span><span style="color: #4f97d7;">)</span>
doggie.bark<span style="color: #4f97d7;">()</span>
doggie.eat<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"-------------"</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">ruffi</span> = Mops<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Ruffi"</span>, <span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span>
ruffi.eat<span style="color: #4f97d7;">()</span>
ruffi.bark<span style="color: #4f97d7;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Übung: Objektorientiertes Bankkonto</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Implementiert die Klasse <code>Bankkonto</code>.
</p>

<ul class="org-ul">
<li>Ein Bankkonto hat eine eindeutige ID und einen Kontostand (anfänglich 0)
</li>
<li>Man kann einen bestimmten Betrag einzahlen und auszahlen
</li>
<li>Man kann sich den aktuellen Kontostand ausgeben lassen
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Übung (fortgeschritten): Piraterie</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<a href="https://www.codewars.com/kata/object-oriented-piracy">https://www.codewars.com/kata/object-oriented-piracy</a>
</p>
</div>
</div>
</div>
