python-course/part1_4.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Weiterführend: Python lernen</h2>
<div class="outline-text-2" id="text-4">
<p>
Der erste Teil des Kurses ist vorbei und ihr möchtet alleine weitermachen? Kein Problem, es gibt eine Vielzahl von Möglichkeiten.
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> CodeCombat</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Von einer Teilnehmerin empfohlen, kann man hier spielerisch am Ball bleiben: <a href="https://codecombat.com/play/">Link</a>
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Coding - Katas</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Unter Entwicklern hat sich eine bestimmte Trainingsmethode etabliert: Die sogenannten Katas (der Begriff kommt aus dem Kampfsport). Hierbei schreibt ein Entwickler ein Problem auf, dass es zu lösen gilt. Zusätzlich schreibt der Herausforderer Test-Code der Überprüft, ob das Problem richtig gelöst wurde. Der andere Entwickler muss dann versuchen, das Problem so zu lösen dass der Test erfolgreich verläuft.
</p>

<p>
Es gibt eine Website, auf der man diese Katas in allen Schwierigkeitsgraden lösen kann: <a href="http://www.codewars.com/r/iQ48PQ">www.codewars.com</a>. Meldet euch gerne dort an (wenn ihr wollt, tretet dem Clan "moinworld" bei). Eine unterhaltsame Möglichkeit zum Üben :)
</p>

<p>
Viele Aufgaben aus diesem Kurs habe ich übrigens von dieser Website. Hier die komplette Liste, falls ihr dafür die Punkte holen wollt:
</p>

<p>
<a href="https://www.codewars.com/kata/drink-about/python">https://www.codewars.com/kata/drink-about/python</a>
</p>

<p>
<a href="https://www.codewars.com/kata/thinkful-logic-drills-traffic-light">https://www.codewars.com/kata/thinkful-logic-drills-traffic-light</a>
</p>

<p>
<a href="https://www.codewars.com/kata/sum-of-multiples">https://www.codewars.com/kata/sum-of-multiples</a>
</p>

<p>
<a href="http://www.codewars.com/kata/century-from-year/train/python">http://www.codewars.com/kata/century-from-year/train/python</a>
</p>

<p>
<a href="http://www.codewars.com/kata/grasshopper-terminal-game-combat-function-1/train/python">http://www.codewars.com/kata/grasshopper-terminal-game-combat-function-1/train/python</a>
</p>

<p>
<a href="http://www.codewars.com/kata/abbreviate-a-two-word-name/train/python">http://www.codewars.com/kata/abbreviate-a-two-word-name/train/python</a>
</p>

<p>
Für unser Erfahrungslevel sind Kata der Schwierigkeitsstufe 8 und 7 (sprache Python!) geeignet.
</p>

<p>
<a href="http://www.codewars.com/kata/search/python?q=&amp;r%5B%5D=-8&amp;r%5B%5D=-7&amp;beta=false">http://www.codewars.com/kata/search/python?q=&amp;r%5B%5D=-8&amp;r%5B%5D=-7&amp;beta=false</a>
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Online - Kurse</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Generell eine gute Resource um selbst zu lernen ist der Kurs von codecadamy: <a href="https://www.codecademy.com/learn/learn-python">https://www.codecademy.com/learn/learn-python</a> Dort gibt es interaktive Erklärungen zum Stoff und auch Übungsaufgaben die ganz genau erklärt und mit Hinweisen bestückt sind. Aber vorsicht: Dieser Kurs lehrt die Python Version zwei. Ist aber wie bereits erwähnt nicht schlimm, da der Unterschied zwischen Python 2 und 3 nicht groß ist. Es gibt auch einen Kurs für Python3, Kostet aber ziemlich viel (Mitgliedschaft für ~ 20€ /Monat), immerhin gibt es eine kostenlose 7 Tage mitgliedschaft.
</p>

<p>
Darüber hinaus gibt es noch unzählige Kurse, sogar mobile Apps zum Lernen. Die habe ich natürlich nicht alle ausprobiert, aber generell sind solche Kurse zumindest vom Inhalt in guter Qualität. Das beste ist, etwas zu suchen was einem Spass macht und voran bringt.
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Eigene Projekte</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Für die Motivation super: Ein eigenes Projekt ausdenken (nicht zu schwierig!) und einfach kraft Suchmaschine und Entwicklerforen wie stackoverflow.com / moinworld slack umsetzen.
</p>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Lösungen zu den letzten Aufgaben</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Funktionen</a></li>
<li><a href="#sec-1-2">1.2. Number guessing game</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Mengen</a></li>
<li><a href="#sec-3">3. Objektorientierte Programmierung</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Klassen und Objekte</a></li>
<li><a href="#sec-3-2">3.2. Vererbung</a></li>
<li><a href="#sec-3-3">3.3. Übung: Objektorientiertes Bankkonto</a></li>
<li><a href="#sec-3-4">3.4. Übung (fortgeschritten): Piraterie</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Weiterführend: Python lernen</a>
<ul class="nav">
<li><a href="#sec-4-1">4.1. CodeCombat</a></li>
<li><a href="#sec-4-2">4.2. Coding - Katas</a></li>
<li><a href="#sec-4-3">4.3. Online - Kurse</a></li>
<li><a href="#sec-4-4">4.4. Eigene Projekte</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
